In [0]:
# Import required modules
import pandas as pd
import numpy as np

In [0]:
data = {
        'name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 
        'age': [42, 52, 36, 24, 73], 
        'preTestScore': [4, 24, 31, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70]
       }

In [3]:
df = pd.DataFrame(data, columns = ['name', 'age', 'preTestScore', 'postTestScore'])
df

    name  age  preTestScore  postTestScore
0  Jason   42             4             25
1  Molly   52            24             94
2   Tina   36            31             57
3   Jake   24             2             62
4    Amy   73             3             70

In [15]:
# Create a new column called df.elderly where the value is yes
# Create a Column Call df.Grade where the postTestScore is greater than 60 is Pass else Fail
df['elderly']= np.where(df['age'] >50, 'Yes','No')
df

    name  age  preTestScore  postTestScore elderly Grade
0  Jason   42             4             25      No  Pass
1  Molly   52            24             94     Yes  Pass
2   Tina   36            31             57      No  Pass
3   Jake   24             2             62      No  Pass
4    Amy   73             3             70     Yes  Pass

In [14]:
# Create a Column Call df.Grade where the postTestScore is greater than 60 is Pass else Fail

df['Grade']=np.where(df['postTestScore']>20,'Pass','Fail')
df

    name  age  preTestScore  postTestScore elderly Grade
0  Jason   42             4             25      No  Pass
1  Molly   52            24             94     Yes  Pass
2   Tina   36            31             57      No  Pass
3   Jake   24             2             62      No  Pass
4    Amy   73             3             70     Yes  Pass